"\n\nAccessible Containers"="\n\nAccessible Containers";
"\n\nAccessible Keychain Groups"="\n\nAccessible Keychain Groups";
"\n\nCapabilities"="\n\nCapabilities";
"\n\nDevice Info"="\n\nDevice Info";
"\n\nPrivacy"="\n\nPrivacy";
"\n\nSandboxing"="\n\nSandboxing";
"\nBundle Identifier: %@"="\nBundle Identifier: %@";
"\nSize: %@"="\nSize: %@";
"\nThe app can access protected information about this device:\n"="\nThe app can access protected information about this device:\n";
"\nThe app can access the following services without asking for permission:\n"="\nThe app can access the following services without asking for permission:\n";
"\nThe app can not spawn other binaries."="\nThe app can not spawn other binaries.";
"\nThe app can spawn arbitrary binaries as the mobile user."="\nThe app can spawn arbitrary binaries as the mobile user.";
"\nThe app can spawn its own embedded binaries with root privileges."="\nThe app can spawn its own embedded binaries with root privileges.";
"\nThe app runs sandboxed and can only access the containers listed below."="\nThe app runs sandboxed and can only access the containers listed below.";
"\nThe app runs unsandboxed and can access most of the file system."="\nThe app runs unsandboxed and can access most of the file system.";
"\nUnrestricted, the app can access all data containers on the system."="\nUnrestricted, the app can access all data containers on the system.";
"\nUnrestricted, the app can access the entire keychain."="\nUnrestricted, the app can access the entire keychain.";
"\nVersion: %@"="\nVersion: %@";
"%@ %@\n\n© 2022-2024 Lars Fröder (opa334)\n\nTrollStore is NOT for piracy!\n\nCredits:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid"="%@ %@\n\n© 2022-2024 Lars Fröder (opa334)\n\nTrollStore is NOT for piracy!\n\nCredits:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid";
"%@ %@\n\n© 2022-2026 Lars Fröder (opa334)\n\nTrollStore is NOT for piracy!\n\nCredits:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid"="%@ %@\n\n© 2022-2026 Lars Fröder (opa334)\n\nTrollStore is NOT for piracy!\n\nCredits:\nGoogle TAG, @alfiecg_dev: CoreTrust bug\n@lunotech11, @SerenaKit, @tylinux, @TheRealClarity, @dhinakg, @khanhduytran0: Various contributions\n@ProcursusTeam: uicache, ldid\n@cstar_ow: uicache\n@saurik: ldid";
"A non TrollStore or a Trollstore Lite app with the same identifier is already installed. If you are absolutely sure it is not, you can force install it."="A non TrollStore or a Trollstore Lite app with the same identifier is already installed. If you are absolutely sure it is not, you can force install it.";
"Advanced"="Advanced";
"Alfie"="Alfie";
"Alfie found the new CoreTrust bug (CVE-2023-41991) via patchdiffing, produced a POC binary and worked on automatically applying it with the help of the ChOma library, while also contributing to said library."="Alfie found the new CoreTrust bug (CVE-2023-41991) via patchdiffing, produced a POC binary and worked on automatically applying it with the help of the ChOma library, while also contributing to said library.";
"Always (Recommended)"="Always (Recommended)";
"Apps"="Apps";
"Cancel"="Cancel";
"Close"="Close";
"Confirm Uninstallation"="Confirm Uninstallation";
"Continue"="Continue";
"Copy Debug Log"="Copy Debug Log";
"Custom"="Custom";
"Default Configuration"="Default Configuration";
"Developer Mode"="Developer Mode";
"Donate"="Donate";
"Donate to alfiecg_dev"="Donate to alfiecg_dev";
"Donate to opa334"="Donate to opa334";
"Downloading"="Downloading";
"Enable Developer Mode"="Enable Developer Mode";
"Error"="Error";
"Error %d"="Error %d";
"Error downloading TrollStore: %@"="Error downloading TrollStore: %@";
"Error downloading app: %@"="Error downloading app: %@";
"Error downloading ldid: %@"="Error downloading ldid: %@";
"Error enabling JIT: trollstorehelper returned %d"="Error enabling JIT: trollstorehelper returned %d";
"Error installing TrollStore: trollstorehelper returned %d"="Error installing TrollStore: trollstorehelper returned %d";
"Failed to add app to icon cache."="Failed to add app to icon cache.";
"Failed to copy app bundle."="Failed to copy app bundle.";
"Failed to create container for app bundle."="Failed to create container for app bundle.";
"Failed to enable developer mode."="Failed to enable developer mode.";
"Failed to extract IPA file."="Failed to extract IPA file.";
"Failed to extract update tar file."="Failed to extract update tar file.";
"Failed to mark app as TrollStore app."="Failed to mark app as TrollStore app.";
"Failed to open %@"="Failed to open %@";
"Failed to sign the app. The CoreTrust bypass returned a non zero status code."="Failed to sign the app. The CoreTrust bypass returned a non zero status code.";
"Failed to sign the app. ldid returned a non zero status code."="Failed to sign the app. ldid returned a non zero status code.";
"Force Installation"="Force Installation";
"Helper Installed as Standalone App"="Helper Installed as Standalone App";
"Helper Installed into %@"="Helper Installed into %@";
"If an app does not immediately appear after installation, respring here and it should appear afterwards."="If an app does not immediately appear after installation, respring here and it should appear afterwards.";
"In order for TrollStore to be able to install unsigned IPAs, ldid has to be installed using this button. It can't be directly included in TrollStore because of licensing issues."="In order for TrollStore to be able to install unsigned IPAs, ldid has to be installed using this button. It can't be directly included in TrollStore because of licensing issues.";
"In order to properly apply the change of the URL scheme setting, rebuilding the icon cache is needed."="In order to properly apply the change of the URL scheme setting, rebuilding the icon cache is needed.";
"Install"="Install";
"Install Error %d"="Install Error %d";
"Install IPA File"="Install IPA File";
"Install Persistence Helper"="Install Persistence Helper";
"Install from URL"="Install from URL";
"Install ldid"="Install ldid";
"Installation Method"="Installation Method";
"Installation Method Segment"="Installation Method Segment";
"Installing"="Installing";
"Installing TrollStore"="Installing TrollStore";
"Installing ldid"="Installing ldid";
"Metadata"="Metadata";
"Never (Not Recommeded)"="Never (Not Recommeded)";
"Only on Remote URL Installs"="Only on Remote URL Installs";
"Opa developed the ChOma library, helped with automating the bug using it and integrated it into TrollStore."="Opa developed the ChOma library, helped with automating the bug using it and integrated it into TrollStore.";
"Open"="Open";
"Open with JIT"="Open with JIT";
"Parse Error %ld"="Parse Error %ld";
"Persistence"="Persistence";
"Reboot Now"="Reboot Now";
"Reboot Required"="Reboot Required";
"Rebuild Icon Cache"="Rebuild Icon Cache";
"Rebuild Later"="Rebuild Later";
"Rebuild Now"="Rebuild Now";
"Rebuilding Icon Cache"="Rebuilding Icon Cache";
"Refresh App Registrations"="Refresh App Registrations";
"Refreshing"="Refreshing";
"Respring"="Respring";
"Root View Controller"="Root View Controller";
"Security"="Security";
"Select App"="Select App";
"Select a system app to install the TrollStore Persistence Helper into. The normal function of the app will not be available, so it is recommended to pick something useless like the Tips app."="Select a system app to install the TrollStore Persistence Helper into. The normal function of the app will not be available, so it is recommended to pick something useless like the Tips app.";
"Settings"="Settings";
"Show Details"="Show Details";
"Show Install Confirmation Alert"="Show Install Confirmation Alert";
"Signing"="Signing";
"Some apps require developer mode enabled to launch. This requires a reboot to take effect."="Some apps require developer mode enabled to launch. This requires a reboot to take effect.";
"System"="System";
"The IPA file does not appear to contain an app."="The IPA file does not appear to contain an app.";
"The IPA file does not exist or is not accessible."="The IPA file does not exist or is not accessible.";
"The URL Scheme, when enabled, will allow apps and websites to trigger TrollStore installations through the apple-magnifier:\/\/install?url=<IPA_URL> URL scheme and enable JIT through the apple-magnifier:\/\/enable-jit?bundle-id=<BUNDLE_ID> URL scheme."="The URL Scheme, when enabled, will allow apps and websites to trigger TrollStore installations through the apple-magnifier:\/\/install?url=<IPA_URL> URL scheme and enable JIT through the apple-magnifier:\/\/enable-jit?bundle-id=<BUNDLE_ID> URL scheme.";
"The app does not contain an Info.plist file."="The app does not contain an Info.plist file.";
"The app is not signed with a fake CoreTrust certificate and ldid is not installed. Install ldid in the settings tab and try again."="The app is not signed with a fake CoreTrust certificate and ldid is not installed. Install ldid in the settings tab and try again.";
"The app was installed successfully, but has additional binaries that are encrypted (e.g. extensions, plugins). The app itself should work, but you may experience broken functionality as a result."="The app was installed successfully, but has additional binaries that are encrypted (e.g. extensions, plugins). The app itself should work, but you may experience broken functionality as a result.";
"The app you tried to install has an encrypted main binary, which cannot have the CoreTrust bypass applied to it. Please ensure you install decrypted apps."="The app you tried to install has an encrypted main binary, which cannot have the CoreTrust bypass applied to it. Please ensure you install decrypted apps.";
"The app you tried to install has the same identifier as a system app already installed on the device. The installation has been prevented to protect you from possible bootloops or other issues."="The app you tried to install has the same identifier as a system app already installed on the device. The installation has been prevented to protect you from possible bootloops or other issues.";
"The app's Info.plist is missing required values."="The app's Info.plist is missing required values.";
"The app's main executable does not exist."="The app's main executable does not exist.";
"URL Scheme Changed"="URL Scheme Changed";
"URL Scheme Enabled"="URL Scheme Enabled";
"Unable to locate Info.plist inside app bundle."="Unable to locate Info.plist inside app bundle.";
"Unable to locate app bundle inside the .IPA archive."="Unable to locate app bundle inside the .IPA archive.";
"Unable to locate main binary inside app bundle."="Unable to locate main binary inside app bundle.";
"Uninstall"="Uninstall";
"Uninstall App"="Uninstall App";
"Uninstall Persistence Helper"="Uninstall Persistence Helper";
"Uninstall TrollStore"="Uninstall TrollStore";
"Uninstall TrollStore, Preserve Apps"="Uninstall TrollStore, Preserve Apps";
"Uninstall TrollStore, Uninstall Apps"="Uninstall TrollStore, Uninstall Apps";
"Uninstallation Method"="Uninstallation Method";
"Uninstalling the app '%@' will delete the app and all data associated to it."="Uninstalling the app '%@' will delete the app and all data associated to it.";
"Uninstalling the persistence helper will revert this app back to it's original state, you will however no longer be able to persistently refresh the TrollStore app registrations. Continue?"="Uninstalling the persistence helper will revert this app back to it's original state, you will however no longer be able to persistently refresh the TrollStore app registrations. Continue?";
"Unknown Error"="Unknown Error";
"Update Available"="Update Available";
"Update TrollStore to %@"="Update TrollStore to %@";
"Update to %@"="Update to %@";
"Updated TrollStore!"="Updated TrollStore!";
"Updating TrollStore"="Updating TrollStore";
"Updating TrollStore..."="Updating TrollStore...";
"User"="User";
"Utilities"="Utilities";
"Warning"="Warning";
"You are about to uninstall TrollStore, do you want to preserve the apps installed by it?"="You are about to uninstall TrollStore, do you want to preserve the apps installed by it?";
"installd"="installd";
"installd (Recommended):\nUninstalls applications using the same API that SpringBoard uses when uninstalling them from the home screen.\n\nCustom:\nUninstalls applications by removing them from icon cache and then deleting their application and data bundles directly.\n\nNOTE: In cases where installd is selected but the stock uninstallation fails, TrollStore automatically falls back to using the Custom method."="installd (Recommended):\nUninstalls applications using the same API that SpringBoard uses when uninstalling them from the home screen.\n\nCustom:\nUninstalls applications by removing them from icon cache and then deleting their application and data bundles directly.\n\nNOTE: In cases where installd is selected but the stock uninstallation fails, TrollStore automatically falls back to using the Custom method.";
"installd:\nInstalls applications by doing a placeholder installation through installd, fixing the permissions and then adding it to icon cache.\nAdvantage: Might be slightly more persistent than the custom method in terms of icon cache reloads.\nDisadvantage: Causes some small issues with certain applications for seemingly no reason (E.g. Watusi cannot save preferences when being installed using this method).\n\nCustom (Recommended):\nInstalls applications by manually creating a bundle using MobileContainerManager, copying the app into it and adding it to icon cache.\nAdvantage: No known issues (As opposed to the Watusi issue outlined in the installd method).\nDisadvantage: Might be slightly less persistent then the installd method in terms of icon cache reloads.\n\nNOTE: In cases where installd is selected but the placeholder installation fails, TrollStore automatically falls back to using the Custom method."="installd:\nInstalls applications by doing a placeholder installation through installd, fixing the permissions and then adding it to icon cache.\nAdvantage: Might be slightly more persistent than the custom method in terms of icon cache reloads.\nDisadvantage: Causes some small issues with certain applications for seemingly no reason (E.g. Watusi cannot save preferences when being installed using this method).\n\nCustom (Recommended):\nInstalls applications by manually creating a bundle using MobileContainerManager, copying the app into it and adding it to icon cache.\nAdvantage: No known issues (As opposed to the Watusi issue outlined in the installd method).\nDisadvantage: Might be slightly less persistent then the installd method in terms of icon cache reloads.\n\nNOTE: In cases where installd is selected but the placeholder installation fails, TrollStore automatically falls back to using the Custom method.";
"ldid is installed and allows TrollStore to install unsigned IPA files."="ldid is installed and allows TrollStore to install unsigned IPA files.";
"ldid: Installed"="ldid: Installed";
"Context: User state in registration"="Context: User state in registration";
"Context: System state in registration"="Context: System state in registration";
"Powered by Fugu15 CoreTrust & installd bugs, thanks to @LinusHenze\n\n© 2022-2024 Lars Fröder (opa334)"="Powered by Fugu15 CoreTrust & installd bugs, thanks to @LinusHenze\n\n© 2022-2024 Lars Fröder (opa334)";
"Powered by CVE-2023-41991, originally discovered by Google TAG, rediscovered via patchdiffing by @alfiecg_dev\n\n© 2022-2024 Lars Fröder (opa334)"="Powered by CVE-2023-41991, originally discovered by Google TAG, rediscovered via patchdiffing by @alfiecg_dev\n\n© 2022-2024 Lars Fröder (opa334)";
"Info"="Info";
"Install TrollStore"="Install TrollStore";
"Unregister Persistence Helper"="Unregister Persistence Helper";
"If you want to use this app as the TrollStore persistence helper, you can register it here."="If you want to use this app as the TrollStore persistence helper, you can register it here.";
"TrollStore Helper"="TrollStore Helper";
"Not Installed"="Not Installed";
"Installed, %@"="Installed, %@";
"Apps will be registered as User by default since AppSync Unified is installed.\n\n"="Apps will be registered as User by default since AppSync Unified is installed.\n\n";
"Transfer Apps"="Transfer Apps";
"Transfering"="Transfering";
"Transfer"="Transfer";
"Transfer Failed"="Transfer Failed";
"Failed to transfer %zu %@"="Failed to transfer %zu %@";
"App"="App";
"apps"="apps";
"app"="app";
"URL"="URL";
"\n\nURL Schemes"="\n\nURL Schemes";
"This option will transfer %zu apps from Trollstore Lite to TrollStore. Continue?"="This option will transfer %zu apps from Trollstore Lite to TrollStore. Continue?";
"Transfer %zu %@"="Transfer %zu %@";
